/**
* @file UVAnimation.h
* @brief アニメーションのためのテクスチャ座標
* @author 織戸　喜隆
* @date 日付（2017.02.14）
*/
#pragma once

#include "stdafx.h"
#include "Common3DType.h"

const std::vector <QuadrangleTexel>   kTexelPlayers = {
//	            v1{ 0, 1 }                v2{ 0, 0 }                v3{ 1, 1 }                v4{ 1, 0 }
	{ { k1_8 * 0, k1_3 * 1 }, { k1_8 * 0, k1_3 * 0 }, { k1_8 * 1, k1_3 * 1 }, { k1_8 * 1, k1_3 * 0 } }, //!<通常のアニメーション 1/4
	{ { k1_8 * 1, k1_3 * 1 }, { k1_8 * 1, k1_3 * 0 }, { k1_8 * 2, k1_3 * 1 }, { k1_8 * 2, k1_3 * 0 } }, //!<通常のアニメーション 2/4
	{ { k1_8 * 2, k1_3 * 1 }, { k1_8 * 2, k1_3 * 0 }, { k1_8 * 3, k1_3 * 1 }, { k1_8 * 3, k1_3 * 0 } }, //!<通常のアニメーション 3/4
	{ { k1_8 * 3, k1_3 * 1 }, { k1_8 * 3, k1_3 * 0 }, { k1_8 * 4, k1_3 * 1 }, { k1_8 * 4, k1_3 * 0 } }	//!<通常のアニメーション 4/4
};

const std::vector <QuadrangleTexel>   kTexelEnemys = {
	//	            v1{ 0, 1 }                v2{ 0, 0 }                v3{ 1, 1 }                v4{ 1, 0 }
	{ { k1_8 * 4, k1_3 * 1 }, { k1_8 * 4, k1_3 * 0 }, { k1_8 * 5, k1_3 * 1 }, { k1_8 * 5, k1_3 * 0 } }, //!<通常のアニメーション 1/4
	{ { k1_8 * 5, k1_3 * 1 }, { k1_8 * 5, k1_3 * 0 }, { k1_8 * 6, k1_3 * 1 }, { k1_8 * 6, k1_3 * 0 } }, //!<通常のアニメーション 2/4
	{ { k1_8 * 6, k1_3 * 1 }, { k1_8 * 6, k1_3 * 0 }, { k1_8 * 7, k1_3 * 1 }, { k1_8 * 7, k1_3 * 0 } }, //!<通常のアニメーション 3/4
	{ { k1_8 * 7, k1_3 * 1 }, { k1_8 * 7, k1_3 * 0 }, { k1_8 * 8, k1_3 * 1 }, { k1_8 * 8, k1_3 * 0 } }	//!<通常のアニメーション 4/4
};

//!<  【ステップ5】バレット
const std::vector <QuadrangleTexel>   kTexelBullets = {
	//	            v1{ 0, 1 }                v2{ 0, 0 }                v3{ 1, 1 }                v4{ 1, 0 }
	{ { k1_5 * 0, k1_1 * 1 }, { k1_5 * 0, k1_1 * 0 }, { k1_5 * 1, k1_1 * 1 }, { k1_5 * 1, k1_1 * 0 } },	//!<スペースシップ
	{ { k1_5 * 1, k1_1 * 1 }, { k1_5 * 1, k1_1 * 0 }, { k1_5 * 2, k1_1 * 1 }, { k1_5 * 2, k1_1 * 0 } }	//!<敵
};

//!<  Explosion
const std::vector <QuadrangleTexel>   kTexelExplosions = {
	//	            v1{ 0, 1 }                v2{ 0, 0 }                v3{ 1, 1 }                v4{ 1, 0 }
	{ { k1_5 * 0, k1_3 * 1 }, { k1_5 * 0, k1_3 * 0 }, { k1_5 * 1, k1_3 * 1 }, { k1_5 * 1, k1_3 * 0 } }, //!<Explosionアニメーション  1/11
	{ { k1_5 * 1, k1_3 * 1 }, { k1_5 * 1, k1_3 * 0 }, { k1_5 * 2, k1_3 * 1 }, { k1_5 * 2, k1_3 * 0 } }, //!<Explosionアニメーション  2/11
	{ { k1_5 * 2, k1_3 * 1 }, { k1_5 * 2, k1_3 * 0 }, { k1_5 * 3, k1_3 * 1 }, { k1_5 * 3, k1_3 * 0 } }, //!<Explosionアニメーション  3/11
	{ { k1_5 * 3, k1_3 * 1 }, { k1_5 * 3, k1_3 * 0 }, { k1_5 * 4, k1_3 * 1 }, { k1_5 * 4, k1_3 * 0 } },	//!<Explosionアニメーション  4/11
	{ { k1_5 * 4, k1_3 * 1 }, { k1_5 * 4, k1_3 * 0 }, { k1_5 * 5, k1_3 * 1 }, { k1_5 * 5, k1_3 * 0 } },	//!<Explosionアニメーション  5/11

	{ { k1_5 * 0, k1_3 * 2 }, { k1_5 * 0, k1_3 * 1 }, { k1_5 * 1, k1_3 * 2 }, { k1_5 * 1, k1_3 * 1 } }, //!<Explosionアニメーション  6/11
	{ { k1_5 * 1, k1_3 * 2 }, { k1_5 * 1, k1_3 * 1 }, { k1_5 * 2, k1_3 * 2 }, { k1_5 * 2, k1_3 * 1 } }, //!<Explosionアニメーション  7/11
	{ { k1_5 * 2, k1_3 * 2 }, { k1_5 * 2, k1_3 * 1 }, { k1_5 * 3, k1_3 * 2 }, { k1_5 * 3, k1_3 * 1 } }, //!<Explosionアニメーション  8/11
	{ { k1_5 * 3, k1_3 * 2 }, { k1_5 * 3, k1_3 * 1 }, { k1_5 * 4, k1_3 * 2 }, { k1_5 * 4, k1_3 * 1 } },	//!<Explosionアニメーション  9/11
	{ { k1_5 * 4, k1_3 * 2 }, { k1_5 * 4, k1_3 * 1 }, { k1_5 * 5, k1_3 * 2 }, { k1_5 * 5, k1_3 * 1 } },	//!<Explosionアニメーション 10/11

	{ { k1_5 * 0, k1_3 * 3 }, { k1_5 * 0, k1_3 * 2 }, XMFLOAT2{ k1_5 * 1, k1_3 * 3 }, XMFLOAT2{ k1_5 * 1, k1_3 * 2 } }  //!<Explosionアニメーション 11/11
};